#include <iostream>
using namespace std;

struct student
{
	int number;
	const char* name;
	int VM;
	int DM;
	int programm;
};

int main()
{
	setlocale(LC_ALL, "Russian");

	student a[25] = {
	{ 1, "Авдеев Ярослав Александрович", 79, 69, 74},
	{ 2, "Алексеев Павел Борисович"    , 85, 79, 76},
	{ 3, "Белов Вячеслав Антонович"    , 39, 57, 54},
	{ 4, "Бирюков Тимур Игоревич\t"      , 45, 39, 31},
	{ 5, "Воеводина Алла Андрияновна" , 65, 65, 77},
	{ 6, "Васильева Оксана Романовна" , 90, 86, 78},
	{ 7, "Воронцов Кирилл Игоревич"   , 78, 63, 87},
	{ 8, "Дьячков Артём Викторович"   , 46, 33, 39},
	{ 9, "Железнова Зинаида Вячеславовна", 55, 35, 66},
	{10, "Ивашов Михаил Тарасович\t"    , 63, 85, 86},
	{11, "Исаев Илья Тимофеевич   "   , 64, 68, 87},
	{12, "Князев Михаил Алексеевич"   , 70, 79, 80},
	{13, "Косов Евгений Олегович\t" , 64, 56, 45},
	{14, "Крупнов Сергей Михайлович" , 76, 86, 67},
	{15, "Лагутин Сергей Никонович"  , 88, 80, 68},
	{16, "Лазарев Леонид Ярославович", 53, 75, 65},
	{17, "Моисеев Владимир Леонидович", 39, 44, 38},
	{18, "Миронов Никита Анатольевич" , 78, 76, 75},
	{19, "Мищуров Андрей Андреевич"  , 35, 48, 39},
	{20, "Одинцов Богдан Семёнович"  , 87, 86, 85},
	{21, "Панов Глеб Александрович"  , 76, 73, 66},
	{22, "Тарасов Леонид Николаевич" , 71, 73, 75},
	{23, "Уваров Григорий Богданович" , 65, 74, 78},
	{24, "Щукин Тимур Николаевич\t"     , 67, 58, 68},
	{25, "Юрьев Лев Денисович\t"    , 50, 79, 61}
	};

	int i;

	cout << "№" << "\tИмя\t\t\t\tВМ\tДМ\tПрограммирование\n";
	for (i = 0; i < 25; i++)
		cout << a[i].number << "\t" << a[i].name << "\t" << a[i].VM << "\t" << a[i].DM << "\t" << a[i].programm << "\n";
	
	cout << "\n\nСтуденты, не сдавшие более двух предметов:\n\n";
	cout << "№" << "\tИмя\t\t\t\tВМ\tДМ\tПрограммирование\n";
	for (i = 0; i < 25; i++)
		if (
			((a[i].VM < 40) || (a[i].DM < 40)) &&			
			((a[i].VM < 40) || (a[i].programm < 40)) &&
			((a[i].DM < 40) || (a[i].programm < 40))
			)
			cout << a[i].number << "\t" << a[i].name << "\t" << a[i].VM << "\t" << a[i].DM << "\t" << a[i].programm << "\n";
}

